; ллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллл

    .486                      ; force 32 bit code
    .model flat, stdcall      ; memory model & calling convention
    option casemap :none      ; case sensitive

    PUBLIC chtyptbl

.data
  align 16
  chtyptbl \
    db 0,9,9,9,9,9,9,9,9,6,5,9,9,5,9,9
    db 9,9,9,9,9,9,9,9,9,9,9,9,9,9,9,9
    db 6,5,5,5,9,5,5,5,5,5,4,4,5,4,5,4
    db 1,1,1,1,1,1,1,1,1,1,5,5,5,5,5,5
    db 9,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2
    db 2,2,2,2,2,2,2,2,2,2,2,5,5,5,5,5
    db 5,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3
    db 3,3,3,3,3,3,3,3,3,3,3,5,5,5,9,9
    db 9,9,9,9,9,9,9,9,9,9,9,9,9,9,9,9
    db 9,9,9,9,9,9,9,9,9,9,9,9,9,9,9,9
    db 9,9,9,9,9,9,9,9,9,9,9,9,9,9,9,9
    db 9,9,9,9,9,9,9,9,9,9,9,9,9,9,9,9
    db 9,9,9,9,9,9,9,9,9,9,9,9,9,9,9,9
    db 9,9,9,9,9,9,9,9,9,9,9,9,9,9,9,9
    db 9,9,9,9,9,9,9,9,9,9,9,9,9,9,9,9
    db 9,9,9,9,9,9,9,9,9,9,9,9,9,9,9,9

  ; 1 = numbers
  ; 2 = upper case characters
  ; 3 = lower case characters
  ; 4 = arithmetic operators
  ; 5 = punctuation & crlf
  ; 6 = space or tab

; ллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллл

    end
